app/controllers/products_controller.rb

INSERT INTO "products" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-10-13 16:30:05.184404"], ["description", "Coding Dojo Cup"], ["name", "Cup"], ["updated_at", "2014-10-13 16:30:05.184404"]]
---
  def create
    @product = Product.create(products_params)